# 3 способи управління потоком виконання

# умовне виконання -> виконання блоку інструкцій тільки при наступленні якоїсь умови

# цикли -> повторення виконання блоку інструкцій поки виконується якась умова

# винятки(помилки) -> виконання блоку інструкцій в випадку помилки

# УМОВНИЙ ОПЕРАТОР
# if... elif... else
# починається з ключового слова if за яким йде далі умова(Якщо в мене є 50 грн то я куплю молоко)

# після умови ставиться двокрапка і з нового рядка йде блок інструкцій, які будуть виконані, якщо
# умова виконується

# після блоку if може бути нуль або більше блоків elif, інтерпретатор буде послідовно перевіряти всі
# умови elif зверху вниз поки не знайде те яке виконується

# після може бути один блок else, який виконається, якщо всі попередні умови не виконаються

age = int(input('How old are you?: '))

if age >= 18:
    print('You are adult already.')
else:
    print('You are infant yet.')
